name: "mobileclip_s0_image_backend"
backend: "python"
max_batch_size: 256
dynamic_batching { }
input [
  {
    name: "images"
    data_type: TYPE_FP32
    dims: [ 3, 256, 256 ]
  }
]
output [
  {
    name: "embeddings"
    data_type: TYPE_FP32
    dims: [ 512 ]
  }
]
parameters {
  key: "checkpoint_path"
  value: { string_value: "/checkpoints/mobileclip_s0.pt" }
}
instance_group [
  {
    kind: KIND_GPU
    count: 4
  }
]
