name: "mobileclip_s0_image_backend_trt"
platform: "tensorrt_plan"
max_batch_size: 256
dynamic_batching { }
input [
  {
    name: "images"
    data_type: TYPE_FP32
    dims: [ 3, 256, 256 ]
  }
]
output [
  {
    name: "embeddings"
    data_type: TYPE_FP32
    dims: [ 512 ]
  }
]
instance_group [
  {
    kind: KIND_GPU
    count: 1
  }
]
