name: "mobileclip_s0"
backend: "python"
max_batch_size: 0
input [
  {
    name: "image_bytes"
    data_type: TYPE_UINT8
    dims: [ -1 ]
    optional: true
  },
  {
    name: "text"
    data_type: TYPE_STRING
    dims: [ 1 ]
    optional: true
  }
]
output [
  {
    name: "image_embeddings"
    data_type: TYPE_FP32
    dims: [ 512 ]
  },
  {
    name: "text_embeddings"
    data_type: TYPE_FP32
    dims: [ 512 ]
  }
]
instance_group [
  {
    kind: KIND_CPU
    count: 1
  }
]
