name: "mobileclip_s0_text_backend"
backend: "python"
max_batch_size: 64
dynamic_batching { }
input [
  {
    name: "tokens"
    data_type: TYPE_INT64
    dims: [ 77 ]
  }
]
output [
  {
    name: "embeddings"
    data_type: TYPE_FP32
    dims: [ 512 ]
  }
]
parameters {
  key: "checkpoint_path"
  value: { string_value: "/checkpoints/mobileclip_s0.pt" }
}
