name: "mobileclip_s0_text_preprocessing"
backend: "python"
max_batch_size: 0
input [
  {
    name: "text"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]
output [
  {
    name: "tokens"
    data_type: TYPE_INT64
    dims: [ 77 ]
  }
]
